package tree;

/**
 * 二叉树经典题目：
 */
public class AAA {

    /**
     * https://learnku.com/articles/29219
     * ● 二叉树的前序遍历、中序遍历、后续遍历（递归、非递归）
     * ● 二叉树的层次遍历：DFS 和 BFS 都可以解 LevelOrder_102
     * ● 二叉树最大、最小深度
     * ● 判断是否是平衡二叉树
     * ● 判断是否是相同二叉树、对称二叉树
     * ● 反转二叉树 ：226. 翻转二叉树
     * ● 给定单链表 (值有序) 转化成平衡二叉查找树 (leetcode109）：找不到
     * ● 判断二叉树路径和是否存在 (leetcode112）最大路径和？?
     * ● 判断是否是二叉查找树 (leetcode98）：找不到
     *
     * https://blog.csdn.net/qq_32690999/article/details/80484440
     * ● 利用两种遍历结果构造二叉树 #105
     * ● 验证二叉搜索树 #98
     * ● 唯一二叉搜索树 找不到
     * ● 最低的二叉树共同祖先  找不到
     */

}
